"%1$@ •••• %2$@" = "%1$@ •••• %2$@";

"+ Add" = "+ Dodaj";

"Add US bank account" = "Dodaj rachunek bankowy w Stanach Zjednoczonych";

"Add a card" = "Dodaj kartę";

"Add a payment method" = "Dodaj metodę płatności";

"Add card" = "Dodaj kartę";

"Add new card" = "Dodaj nową kartę";

"Add new payment method" = "Dodaj nową metodę płatności";

"Add your payment information" = "Dodaj informacje o płatności";

"Approve payment" = "Zatwierdź płatność";

"Back" = "Wstecz";

"Bank" = "Bank";

"Bank account" = "Konto bankowe";

"Buy now or pay later with <img/>" = "Kup teraz lub zapłać później za pomocą <img/>";

"Buy now or pay later with Afterpay" = "Kup teraz lub zapłać później za pomocą Afterpay";

"Buy now or pay later with Clearpay" = "Kup teraz lub zapłać później za pomocą Clearpay";

"Buy now or pay later with Klarna" = "Kup teraz lub zapłać później z Klarna";

"Buy using a UPI ID" = "Kup za pomocą UPI ID";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Zatwierdzając płatność z PayPal, zezwalasz %@ na obciążenie Twojego konta PayPal przyszłymi płatnościami zgodnie z ich warunkami.";

"By continuing to Amazon Pay, you allow %@ to charge your Amazon Pay account for future payments in accordance with their terms." = "Przechodząc do Amazon Pay, zezwalasz %@ na obciążenie Twojego konta Amazon Pay przyszłymi płatnościami zgodnie z ich warunkami.";

"By continuing to Klarna, you allow %@ to charge your Klarna account for future payments in accordance with their terms and Klarna's terms. You can change this at any time in your Klarna app or by reaching out to %@." = "Przechodząc do Klarna, zezwalasz %1$@ na obciążenie Twojego konta Klarna przyszłymi płatnościami zgodnie z ich warunkami i warunkami Klarna. Możesz to zmienić w dowolnym momencie w aplikacji Klarna lub kontaktując się z %2$@.";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Przechodząc do PayPal, zezwalasz %@ na obciążenie Twojego konta PayPal przyszłymi płatnościami zgodnie z ich warunkami.";

"By continuing to Revolut Pay, you allow %@ to charge your Revolut Pay account for future payments in accordance with their terms." = "Przechodząc do Revolut Pay, zezwalasz %@ na obciążenie Twojego konta Revolut Pay przyszłymi płatnościami zgodnie z ich warunkami.";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Kontynuując, wyrażasz zgodę na autoryzowanie płatności zgodnie z <terms>tymi warunkami</terms>.";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "Kontynuując, wyrażasz zgodę na obciążenie przez %1$@ Twojego konta Cash App kwotą tej płatności oraz przyszłych płatności zgodnie z warunkami %2$@ do momentu wycofania zgody. To ustawienie można zmienić w dowolnym momencie w ustawieniach Cash App.";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Dołączając do Link, wyrażasz zgodę na <terms>Warunki</terms> i <privacy>Politykę prywatności</privacy>.";

"By providing your bank account details and confirming this payment, you agree to this Direct Debit Request and the <terms>Direct Debit Request service agreement</terms>, and authorise Stripe Payments Australia Pty Ltd ACN 160 180 343 Direct Debit User ID number 507156 (“Stripe”) to debit your account through the Bulk Electronic Clearing System (BECS) on behalf of %@ (the \"Merchant\") for any amounts separately communicated to you by the Merchant. You certify that you are either an account holder or an authorised signatory on the account listed above." = "Podając dane swojego konta bankowego i potwierdzając tę płatność, wyrażasz zgodę na niniejsze żądanie polecenia zapłaty oraz <terms>umowę dotyczącą usługi polecenia zapłaty</terms>, a także upoważniasz podmiot Stripe Payments Australia Pty Ltd ACN 160 180 343 o identyfikatorze użytkownika polecenia zapłaty 507156 („Stripe”) do obciążenia Twojego konta przez system Bulk Electronic Clearing System (BECS) w imieniu podmiotu %@ („Sprzedawca”) na każdą kwotę osobno zakomunikowaną Ci przez Sprzedawcę. Potwierdzasz, że jesteś właścicielem konta lub upoważnionym sygnatariuszem wyżej wymienionego konta.";

"By providing your card information, you allow %@ to charge your card for future payments in accordance with their terms." = "Poprzez podanie danych karty wyrażasz zgodę na obciążanie przez %@ Twojej karty kwotami przyszłych płatności zgodnie z obowiązującymi warunkami.";

"By providing your email, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Podając swój adres e-mail, zgadzasz się na utworzenie konta Link i zapisanie danych do płatności w Link, zgodnie z <terms>Warunkami</terms> i <privacy>Polityką prywatności</privacy> Link.";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Podając dane płatności i potwierdzając tę płatność, upoważniasz (A) %@ i Stripe, naszego dostawcę usług płatności, do wysłania instrukcji do Twojego banku w celu obciążenia Twojego konta oraz (B) Twój bank do obciążenia Twojego konta zgodnie z tymi instrukcjami. W ramach swoich praw jesteś uprawniony(-a) do otrzymania zwrotu od Twojego banku zgodnie z zasadami i warunkami umowy z bankiem. Zwrot należy odebrać w ciągu 8 tygodni, licząc od daty obciążenia konta. Twoje prawa są wyjaśnione w oświadczeniu, które możesz otrzymać z banku. Wyrażasz zgodę na otrzymywanie powiadomień w przypadku przyszłych obciążeń do 2 dni przed ich wystąpieniem.";

"By providing your phone number, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Podając swój numer telefonu, zgadzasz się na utworzenie konta Link i zapisanie danych do płatności w Link, zgodnie z <terms>Warunkami</terms> i <privacy>Polityką prywatności</privacy> Link.";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Zapisując swoje konto bankowe dla %@, zgadzasz się na autoryzowanie płatności zgodnie z <terms>tymi warunkami</terms>.";

"CPF/CPNJ" = "CPF/CPNJ";

"Cancel and pay another way" = "Anuluj i skorzystaj z innej metody zapłaty";

"Choose a payment method" = "Wybierz metodę płatności";

"Close card scanner" = "Zamknij skaner karty";

"Confirm" = "Potwierdź";

"Confirm the payment in your bank or payment app within %@ to complete the purchase." = "Potwierdź płatność w banku lub aplikacji bankowej w ciągu %@, aby sfinalizować zakup.";

"Confirm the payment in your bank's app within %@ to complete the purchase." = "Potwierdź płatność w aplikacji bankowej w ciągu %@, aby sfinalizować zakup.";

"Confirm your CVC" = "Potwierdź CVC";

"Contact information" = "Dane kontaktowe";

"EPS Bank" = "Bank EPS";

"Enter address manually" = "Wprowadź adres ręcznie";

"FPX Bank" = "FPX Bank";

"I understand that Stripe will be collecting Direct Debits on behalf of %@ and confirm that I am the account holder and the only person required to authorise debits from this account." = "Rozumiem, że Stripe będzie pobierać polecenia zapłaty w imieniu firmy %@ i potwierdzam, że jestem posiadaczem konta i jedyną osobą wymaganą do autoryzowania poleceń zapłaty z tego konta.";

"IBAN" = "IBAN";

"Manage payment method" = "Zarządzaj metodą płatności";

"Manage payment methods" = "Zarządzaj metodami płatności";

"Manage your payment methods" = "Zarządzaj metodami płatności";

"Name on card" = "Imię i nazwisko na karcie";

"New card" = "Nowa karta";

"New payment method" = "Nowa metoda płatności";

"Open your UPI app to approve your payment within %@" = "Otwórz aplikację UPI, aby zatwierdzić płatność w %@";

"Or" = "Lub";

"Or pay using" = "Lub zapłać, korzystając z";

"Or pay with a card" = "Lub zapłać kartą";

"Or use" = "Lub użyj";

"Or use a card" = "Lub użyj karty";

"Pay %@" = "Zapłać %@";

"Pay another way" = "Zapłać w inny sposób";

"Pay faster at %@ and thousands of businesses." = "Płać szybciej w %@ i tysiącach innych firm.";

"Pay over time with %@" = "Zapłać później, korzystając z %@";

"Pay over time with Affirm" = "Zapłać później za pomocą Affirm";

"Pay with Link" = "Zapłać za pomocą Link";

"Pay with your bank account in just a few steps." = "Zapłać za pomocą konta bankowego w kilku krokach.";

"Payment failed" = "Płatność się nie powiodła";

"Please go back and select another payment method" = "Wróć i wybierz inną metodę płatności";

"Point the camera at your card." = "Skieruj aparat na kartę.";

"Processing..." = "Przetwarzanie…";

"Przelewy24 Bank" = "Przelewy24 Bank";

"Remove card?" = "Usunąć kartę?";

"Remove payment method" = "Usuń metodę płatności";

"Save" = "Zapisz";

"Save a new payment method" = "Zapisz nową metodę płatności";

"Save address" = "Zapisz adres";

"Save for future payments" = "Zapisz do przyszłych płatności";

"Save payment details to %@ for future purchases" = "Zapisz informacje o płatności dla %@ do wykorzystania przy przyszłych zakupach";

"Save this account for future %@ payments" = "Zapisz to konto do przyszłych płatności %@";

"Save your bank account in just a few steps." = "Zapisz konto bankowe w kilku krokach.";

"Save your info for secure 1-click checkout with Link" = "Zapisz informacje do bezpiecznej finalizacji jednym kliknięciem z Link";

"Saved" = "Zapisano";

"Select card" = "Wybierz kartę";

"Select payment method" = "Wybierz metodę płatności";

"Select your payment method" = "Wybierz metodę płatności";

"Set up" = "Ustaw";

"Shipping to %@ is not supported." = "Wysyłka do lokalizacji: %@ nie jest obsługiwana";

"Show menu" = "Pokaż menu";

"Simple, secure one-click payments" = "Łatwe, bezpieczne płatności jednym kliknięciem";

"Something went wrong when linking your account.\nPlease try again later." = "Coś poszło nie tak przy podłączaniu konta.\nSpróbuj ponownie później.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you'll get an email with instructions to finish saving your bank account with %@." = "Stripe wpłaci 0,01 USD na Twoje konto w ciągu 1–2 dni roboczych. Następnie otrzymasz wiadomość e-mail z instrukcjami dotyczącymi zakończenia zapisywania konta za pomocą %@.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Stripe wpłaci 0,01 USD na Twoje konto w ciągu 1-2 dni roboczych. Następnie otrzymasz wiadomość e-mail z instrukcjami dotyczącymi zakończenia płatności na rzecz %@.";

"The IBAN you entered is incomplete." = "Podany IBAN jest niepełny.";

"The IBAN you entered is invalid, \"%@\" is not a supported country code." = "Podany numer IBAN jest nieprawidłowy. „%@” nie jest prawidłowym kodem kraju.";

"Update" = "Aktualizuj";

"Update card brand" = "Zaktualizuj markę karty";

"View more" = "Wyświetl więcej";

"Your IBAN should start with a two-letter country code." = "IBAN powinien się zaczynać od dwuliterowego kodu kraju.";

"iDEAL Bank" = "iDEAL Bank";
